## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/0d62ed48-8bb8-4beb-9869-584d96249ed3/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aks_automatic.azapi_resource.aks will be created
  + resource "azapi_resource" "aks" {
      + body                      = {
          + identity   = {
              + type = "SystemAssigned"
            }
          + properties = {
              + addonProfiles       = {
                  + omsagent = {
                      + config  = {
                          + logAnalyticsWorkspaceResourceID = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-wvaksauto/providers/Microsoft.OperationalInsights/workspaces/dev-law-wvaksauto"
                          + useAADAuth                      = "true"
                        }
                      + enabled = true
                    }
                }
              + agentPoolProfiles   = [
                  + {
                      + count  = 3
                      + mode   = "System"
                      + name   = "systempool"
                      + osType = "Linux"
                      + vmSize = "Standard_D2s_v3"
                    },
                ]
              + azureMonitorProfile = {
                  + containerInsights = {
                      + enabled                         = true
                      + logAnalyticsWorkspaceResourceID = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-wvaksauto/providers/Microsoft.OperationalInsights/workspaces/dev-law-wvaksauto"
                    }
                  + metrics           = {
                      + enabled          = true
                      + kubeStateMetrics = {
                          + metricAnnotationsAllowList = ""
                          + metricLabelsAllowlist      = ""
                        }
                    }
                }
            }
          + sku        = {
              + name = "Automatic"
              + tier = "Standard"
            }
          + tags       = {
              + application = "wvaksauto"
              + environment = "dev"
              + owner       = "willvelida"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "australiaeast"
      + name                      = "dev-wvaksauto"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-wvaksauto"
      + response_export_values    = [
          + "properties.identityProfile.kubeletidentity.objectId",
          + "properties.oidcIssuerProfile.issuerURL",
          + "properties.nodeResourceGroup",
        ]
      + schema_validation_enabled = false
      + tags                      = {
          + "application" = "wvaksauto"
          + "environment" = "dev"
          + "owner"       = "willvelida"
        }
      + type                      = "Microsoft.ContainerService/managedClusters@2024-03-02-preview"
    }

  # module.aks_automatic.azurerm_role_assignment.aksrole will be created
  + resource "azurerm_role_assignment" "aksrole" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6ef4778b-9110-4e3b-8390-6ab10d2f1607"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra will be created
  + resource "azurerm_monitor_data_collection_rule_association" "dcra" {
      + data_collection_rule_id = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-wvaksauto/providers/Microsoft.Insights/dataCollectionRules/MSProm-australiaeast-dev-wvaksauto"
      + description             = "Association of DCR. Deleting this association will break the data collection for this AKS Cluster"
      + id                      = (known after apply)
      + name                    = "dcra-dcr-prometheus-aks"
      + target_resource_id      = (known after apply)
    }

  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "kubernetes_recording_rules_rule_group" {
      + cluster_name        = "dev-wvaksauto"
      + description         = "Kubernetes Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "australiaeast"
      + name                = "KubernetesRecordingRulesRuleGroup-dev-wvaksauto"
      + resource_group_name = "rg-wvaksauto"
      + rule_group_enabled  = true
      + scopes              = (known after apply)

      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (cluster, namespace, pod, container) (  irate(container_cpu_usage_seconds_total{job="cadvisor", image!=""}[5m])) * on (cluster, namespace, pod) group_left(node) topk by (cluster, namespace, pod) (  1, max by(cluster, namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_cpu_usage_seconds_total:sum_irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_working_set_bytes{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_working_set_bytes"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_rss{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_rss"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_cache{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_cache"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_swap{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_swap"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ( (kube_pod_status_phase{phase=~"Pending|Running"} == 1) )
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    label_replace(      kube_pod_owner{job="kube-state-metrics", owner_kind="ReplicaSet"},      "replicaset", "$1", "owner_name", "(.*)"    ) * on(replicaset, namespace) group_left(owner_name) topk by(replicaset, namespace) (      1, max by (replicaset, namespace, owner_name) (        kube_replicaset_owner{job="kube-state-metrics"}      )    ),    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "deployment"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="DaemonSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "daemonset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="StatefulSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "statefulset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="Job"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "job"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(  node_memory_MemAvailable_bytes{job="node"} or  (    node_memory_Buffers_bytes{job="node"} +    node_memory_Cached_bytes{job="node"} +    node_memory_MemFree_bytes{job="node"} +    node_memory_Slab_bytes{job="node"}  )) by (cluster)
            EOT
          + record     = ":node_memory_MemAvailable_bytes:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(rate(node_cpu_seconds_total{job="node",mode!="idle",mode!="iowait",mode!="steal"}[5m])) by (cluster) /count(sum(node_cpu_seconds_total{job="node"}) by (cluster, instance, cpu)) by (cluster)
            EOT
          + record     = "cluster:node_cpu:ratio_rate5m"
        }
    }

  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_recording_rules_rule_group" {
      + cluster_name        = "dev-wvaksauto"
      + description         = "Node Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "australiaeast"
      + name                = "NodeRecordingRulesRuleGroup-dev-wvaksauto"
      + resource_group_name = "rg-wvaksauto"
      + rule_group_enabled  = true
      + scopes              = (known after apply)

      + rule {
          + enabled    = true
          + expression = <<-EOT
                count without (cpu, mode) (  node_cpu_seconds_total{job="node",mode="idle"})
            EOT
          + record     = "instance:node_num_cpu:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - avg without (cpu) (  sum without (mode) (rate(node_cpu_seconds_total{job="node", mode=~"idle|iowait|steal"}[5m])))
            EOT
          + record     = "instance:node_cpu_utilisation:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                (  node_load1{job="node"}/  instance:node_num_cpu:sum{job="node"})
            EOT
          + record     = "instance:node_load1_per_cpu:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - (  (    node_memory_MemAvailable_bytes{job="node"}    or    (      node_memory_Buffers_bytes{job="node"}      +      node_memory_Cached_bytes{job="node"}      +      node_memory_MemFree_bytes{job="node"}      +      node_memory_Slab_bytes{job="node"}    )  )/  node_memory_MemTotal_bytes{job="node"})
            EOT
          + record     = "instance:node_memory_utilisation:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_vmstat_pgmajfault{job="node"}[5m])
            EOT
          + record     = "instance:node_vmstat_pgmajfault:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_weighted_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_weighted_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_drop_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_drop_excluding_lo:rate5m"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aks_json_output = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.aks_automatic.azapi_resource.aks will be created%0A  + resource "azapi_resource" "aks" {%0A      + body                      = {%0A          + identity   = {%0A              + type = "SystemAssigned"%0A            }%0A          + properties = {%0A              + addonProfiles       = {%0A                  + omsagent = {%0A                      + config  = {%0A                          + logAnalyticsWorkspaceResourceID = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-wvaksauto/providers/Microsoft.OperationalInsights/workspaces/dev-law-wvaksauto"%0A                          + useAADAuth                      = "true"%0A                        }%0A                      + enabled = true%0A                    }%0A                }%0A              + agentPoolProfiles   = [%0A                  + {%0A                      + count  = 3%0A                      + mode   = "System"%0A                      + name   = "systempool"%0A                      + osType = "Linux"%0A                      + vmSize = "Standard_D2s_v3"%0A                    },%0A                ]%0A              + azureMonitorProfile = {%0A                  + containerInsights = {%0A                      + enabled                         = true%0A                      + logAnalyticsWorkspaceResourceID = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-wvaksauto/providers/Microsoft.OperationalInsights/workspaces/dev-law-wvaksauto"%0A                    }%0A                  + metrics           = {%0A                      + enabled          = true%0A                      + kubeStateMetrics = {%0A                          + metricAnnotationsAllowList = ""%0A                          + metricLabelsAllowlist      = ""%0A                        }%0A                    }%0A                }%0A            }%0A          + sku        = {%0A              + name = "Automatic"%0A              + tier = "Standard"%0A            }%0A          + tags       = {%0A              + application = "wvaksauto"%0A              + environment = "dev"%0A              + owner       = "willvelida"%0A            }%0A        }%0A      + id                        = (known after apply)%0A      + ignore_casing             = false%0A      + ignore_missing_property   = true%0A      + location                  = "australiaeast"%0A      + name                      = "dev-wvaksauto"%0A      + output                    = (known after apply)%0A      + parent_id                 = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-wvaksauto"%0A      + response_export_values    = [%0A          + "properties.identityProfile.kubeletidentity.objectId",%0A          + "properties.oidcIssuerProfile.issuerURL",%0A          + "properties.nodeResourceGroup",%0A        ]%0A      + schema_validation_enabled = false%0A      + tags                      = {%0A          + "application" = "wvaksauto"%0A          + "environment" = "dev"%0A          + "owner"       = "willvelida"%0A        }%0A      + type                      = "Microsoft.ContainerService/managedClusters@2024-03-02-preview"%0A    }%0A%0A  # module.aks_automatic.azurerm_role_assignment.aksrole will be created%0A  + resource "azurerm_role_assignment" "aksrole" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = "6ef4778b-9110-4e3b-8390-6ab10d2f1607"%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Azure Kubernetes Service RBAC Cluster Admin"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra will be created%0A  + resource "azurerm_monitor_data_collection_rule_association" "dcra" {%0A      + data_collection_rule_id = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-wvaksauto/providers/Microsoft.Insights/dataCollectionRules/MSProm-australiaeast-dev-wvaksauto"%0A      + description             = "Association of DCR. Deleting this association will break the data collection for this AKS Cluster"%0A      + id                      = (known after apply)%0A      + name                    = "dcra-dcr-prometheus-aks"%0A      + target_resource_id      = (known after apply)%0A    }%0A%0A  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group will be created%0A  + resource "azurerm_monitor_alert_prometheus_rule_group" "kubernetes_recording_rules_rule_group" {%0A      + cluster_name        = "dev-wvaksauto"%0A      + description         = "Kubernetes Recording Rules Rule Group"%0A      + id                  = (known after apply)%0A      + interval            = "PT1M"%0A      + location            = "australiaeast"%0A      + name                = "KubernetesRecordingRulesRuleGroup-dev-wvaksauto"%0A      + resource_group_name = "rg-wvaksauto"%0A      + rule_group_enabled  = true%0A      + scopes              = (known after apply)%0A%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (cluster, namespace, pod, container) (  irate(container_cpu_usage_seconds_total{job="cadvisor", image!=""}[5m])) * on (cluster, namespace, pod) group_left(node) topk by (cluster, namespace, pod) (  1, max by(cluster, namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_cpu_usage_seconds_total:sum_irate"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_working_set_bytes{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_working_set_bytes"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_rss{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_rss"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_cache{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_cache"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_swap{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_swap"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))%0A            EOT%0A          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_requests"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_memory:kube_pod_container_resource_requests:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))%0A            EOT%0A          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_requests"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_cpu:kube_pod_container_resource_requests:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))%0A            EOT%0A          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_limits"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_memory:kube_pod_container_resource_limits:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ( (kube_pod_status_phase{phase=~"Pending|Running"} == 1) )%0A            EOT%0A          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_limits"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_cpu:kube_pod_container_resource_limits:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    label_replace(      kube_pod_owner{job="kube-state-metrics", owner_kind="ReplicaSet"},      "replicaset", "$1", "owner_name", "(.*)"    ) * on(replicaset, namespace) group_left(owner_name) topk by(replicaset, namespace) (      1, max by (replicaset, namespace, owner_name) (        kube_replicaset_owner{job="kube-state-metrics"}      )    ),    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "deployment"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="DaemonSet"},    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "daemonset"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="StatefulSet"},    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "statefulset"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="Job"},    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "job"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum(  node_memory_MemAvailable_bytes{job="node"} or  (    node_memory_Buffers_bytes{job="node"} +    node_memory_Cached_bytes{job="node"} +    node_memory_MemFree_bytes{job="node"} +    node_memory_Slab_bytes{job="node"}  )) by (cluster)%0A            EOT%0A          + record     = ":node_memory_MemAvailable_bytes:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum(rate(node_cpu_seconds_total{job="node",mode!="idle",mode!="iowait",mode!="steal"}[5m])) by (cluster) /count(sum(node_cpu_seconds_total{job="node"}) by (cluster, instance, cpu)) by (cluster)%0A            EOT%0A          + record     = "cluster:node_cpu:ratio_rate5m"%0A        }%0A    }%0A%0A  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group will be created%0A  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_recording_rules_rule_group" {%0A      + cluster_name        = "dev-wvaksauto"%0A      + description         = "Node Recording Rules Rule Group"%0A      + id                  = (known after apply)%0A      + interval            = "PT1M"%0A      + location            = "australiaeast"%0A      + name                = "NodeRecordingRulesRuleGroup-dev-wvaksauto"%0A      + resource_group_name = "rg-wvaksauto"%0A      + rule_group_enabled  = true%0A      + scopes              = (known after apply)%0A%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                count without (cpu, mode) (  node_cpu_seconds_total{job="node",mode="idle"})%0A            EOT%0A          + record     = "instance:node_num_cpu:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                1 - avg without (cpu) (  sum without (mode) (rate(node_cpu_seconds_total{job="node", mode=~"idle|iowait|steal"}[5m])))%0A            EOT%0A          + record     = "instance:node_cpu_utilisation:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                (  node_load1{job="node"}/  instance:node_num_cpu:sum{job="node"})%0A            EOT%0A          + record     = "instance:node_load1_per_cpu:ratio"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                1 - (  (    node_memory_MemAvailable_bytes{job="node"}    or    (      node_memory_Buffers_bytes{job="node"}      +      node_memory_Cached_bytes{job="node"}      +      node_memory_MemFree_bytes{job="node"}      +      node_memory_Slab_bytes{job="node"}    )  )/  node_memory_MemTotal_bytes{job="node"})%0A            EOT%0A          + record     = "instance:node_memory_utilisation:ratio"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                rate(node_vmstat_pgmajfault{job="node"}[5m])%0A            EOT%0A          + record     = "instance:node_vmstat_pgmajfault:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                rate(node_disk_io_time_seconds_total{job="node", device!=""}[5m])%0A            EOT%0A          + record     = "instance_device:node_disk_io_time_seconds:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                rate(node_disk_io_time_weighted_seconds_total{job="node", device!=""}[5m])%0A            EOT%0A          + record     = "instance_device:node_disk_io_time_weighted_seconds:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_receive_bytes_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_receive_bytes_excluding_lo:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_transmit_bytes_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_transmit_bytes_excluding_lo:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_receive_drop_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_receive_drop_excluding_lo:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_transmit_drop_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_transmit_drop_excluding_lo:rate5m"%0A        }%0A    }%0A%0APlan: 5 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + aks_json_output = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>